// Задача 2. Даны два числа a, b, такие что a < b. 
// Вывести на экран сколько раз число a поместиться в числе b.

int a = 3;
int b = 13;

Console.Clear();
Console.WriteLine(b / a);